#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tls_private_key.main: Refreshing state... [id=4119ca4cd5ce24c48fdf4cf899d47539e4623ff2]
module.naming.random_string.first_letter: Refreshing state... [id=p]
module.naming.random_string.main: Refreshing state... [id=tnjt39r1q8odgpx0xzu30njg08jgcz8c28ulriolr5aoht2af08os5e3muvi]
local_file.ssh_pvt_key: Refreshing state... [id=1a439d8bb91ab976e3e506690faddd4428d7df15]
data.github_repository_environments.adv: Reading...
github_actions_environment_secret.vm_ssh_key: Refreshing state... [id=terraform-poc:dev:VM_SSH_KEY]
data.github_repository_environments.adv: Read complete after 0s [id=terraform-poc]
data.azurerm_dns_zone.adv: Reading...
data.azurerm_resource_group.adv: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.adv_dns_rg: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jODMwMjg3Yi1lNjVkLTQwMjUtYTUyNC0zNzkzOTIwYTEzOTA7b2JqZWN0SWQ9YzBlZTBlNGMtOWY4OC00NTkwLWIzMTktOTUzN2E1YjhjYmQwO3N1YnNjcmlwdGlvbklkPWFkOWQwNTI5LTQ5YmYtNDU5YS04NmIyLWRjYjZmY2JmOWYzZDt0ZW5hbnRJZD05MzA3YTM1OC01MTZmLTRmY2QtYTgwZi01NWNmMThlNGU1MjA=]
data.azurerm_resource_group.adv: Read complete after 0s [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev]
azurerm_public_ip.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip-advapp-dev]
azurerm_virtual_network.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-advapp-dev]
azurerm_network_security_group.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-advapp-dev]
data.azurerm_resource_group.adv_dns_rg: Read complete after 1s [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-central-india-core-resources]
data.azurerm_dns_zone.adv: Read complete after 1s [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-central-india-core-resources/providers/Microsoft.Network/dnsZones/uttamgolds.in]
azurerm_subnet.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-advapp-dev/subnets/snet-advapp-dev]
azurerm_network_security_rule.ssh: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-advapp-dev/securityRules/ssh]
azurerm_network_security_rule.https: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-advapp-dev/securityRules/https]
azurerm_network_security_rule.http: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-advapp-dev/securityRules/http]
azurerm_dns_a_record.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-central-india-core-resources/providers/Microsoft.Network/dnsZones/uttamgolds.in/A/dev]
local_file.ansible_hosts: Refreshing state... [id=6614bda4cd3f2e95805f8ae8585a30d4d1b1be8c]
azurerm_subnet_network_security_group_association.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-advapp-dev/subnets/snet-advapp-dev]
azurerm_network_interface.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Network/networkInterfaces/nic-advapp-dev]
azurerm_linux_virtual_machine.adv: Refreshing state... [id=/subscriptions/ad9d0529-49bf-459a-86b2-dcb6fcbf9f3d/resourceGroups/rg-adv-tf-demo-dev/providers/Microsoft.Compute/virtualMachines/vm-advapp-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.ansible_hosts will be created
  + resource "local_file" "ansible_hosts" {
      + content              = <<-EOT
            [adv:vars]
            ansible_ssh_private_key_file=adv.pem
            
            [adv]
            dev.uttamgolds.in
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../ansible/playbooks/adv.hosts"
      + id                   = (known after apply)
    }

  # local_file.ssh_pvt_key will be created
  + resource "local_file" "ssh_pvt_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "../../ansible/playbooks/adv.pem"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @tapansam, Action: `pull_request`*